test_results/done/lighttpd/lighttpd_php_wrk.log
http://10.1.0.9:80/html/1B.html
how many requests can you serve in 5 minutes?
1 concurrent
interation: 1
wrk -c1 -t 1 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   204.94us    1.09ms  63.07ms   99.32%
    Req/Sec     6.48k   436.20     7.21k    93.13%
  1933683 requests in 5.00m, 299.09MB read
Requests/sec:   6445.52
Transfer/sec:      1.00MB
interation: 2
wrk -c1 -t 1 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   182.70us    0.95ms  85.46ms   99.52%
    Req/Sec     6.56k   363.85     7.55k    88.48%
  1953368 requests in 5.00m, 302.14MB read
  Socket errors: connect 0, read 1, write 5820, timeout 0
Requests/sec:   6511.19
Transfer/sec:      1.01MB
interation: 3
wrk -c1 -t 1 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   249.02us    1.87ms  84.77ms   99.43%
    Req/Sec     6.57k   482.86     7.38k    93.29%
  1957448 requests in 5.00m, 302.77MB read
  Socket errors: connect 0, read 1, write 6027, timeout 0
Requests/sec:   6524.69
Transfer/sec:      1.01MB
interation: 4
wrk -c1 -t 1 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   191.74us    1.22ms  92.18ms   99.54%
    Req/Sec     6.73k   463.05     7.42k    81.07%
  2009722 requests in 5.00m, 310.85MB read
Requests/sec:   6699.01
Transfer/sec:      1.04MB
interation: 5
wrk -c1 -t 1 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  1 threads and 1 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   236.16us    1.77ms  95.89ms   99.42%
    Req/Sec     6.51k   469.78     7.31k    90.05%
  1933947 requests in 5.00m, 299.13MB read
  Socket errors: connect 0, read 2, write 12733, timeout 0
Requests/sec:   6446.42
Transfer/sec:      1.00MB
2 concurrent
interation: 1
wrk -c2 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.50ms   12.64ms 309.55ms   98.03%
    Req/Sec     4.34k   761.80     5.02k    95.77%
  2554944 requests in 5.00m, 395.18MB read
  Socket errors: connect 0, read 4, write 18405, timeout 0
Requests/sec:   8516.05
Transfer/sec:      1.32MB
interation: 2
wrk -c2 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     4.83ms   35.27ms 616.22ms   97.73%
    Req/Sec     4.46k   729.36     5.13k    96.53%
  2583398 requests in 5.00m, 399.59MB read
  Socket errors: connect 0, read 6, write 27550, timeout 0
Requests/sec:   8610.95
Transfer/sec:      1.33MB
interation: 3
wrk -c2 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   268.43us    0.87ms  56.10ms   99.15%
    Req/Sec     4.44k   347.18     5.09k    88.29%
  2611593 requests in 5.00m, 403.95MB read
  Socket errors: connect 0, read 6, write 26467, timeout 0
Requests/sec:   8705.08
Transfer/sec:      1.35MB
interation: 4
wrk -c2 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.08ms    9.25ms 318.14ms   98.08%
    Req/Sec     4.45k   749.64     5.12k    95.68%
  2628065 requests in 5.00m, 406.49MB read
  Socket errors: connect 0, read 4, write 18099, timeout 0
Requests/sec:   8759.74
Transfer/sec:      1.35MB
interation: 5
wrk -c2 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 2 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.99ms    7.05ms 258.85ms   97.66%
    Req/Sec     4.38k   790.38     5.12k    94.64%
  2575057 requests in 5.00m, 398.30MB read
  Socket errors: connect 0, read 6, write 27650, timeout 0
Requests/sec:   8583.10
Transfer/sec:      1.33MB
4 concurrent
interation: 1
wrk -c4 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   422.80us  355.94us  27.58ms   99.18%
    Req/Sec     4.92k   224.82     9.05k    78.09%
  2936491 requests in 5.00m, 454.20MB read
Requests/sec:   9785.06
Transfer/sec:      1.51MB
interation: 2
wrk -c4 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   423.45us  339.73us  25.33ms   99.10%
    Req/Sec     4.92k   228.98     5.44k    73.15%
  2935514 requests in 5.00m, 454.05MB read
Requests/sec:   9784.95
Transfer/sec:      1.51MB
interation: 3
wrk -c4 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   422.64us  291.93us  23.64ms   99.18%
    Req/Sec     4.88k   216.11     8.78k    73.89%
  2912204 requests in 5.00m, 450.44MB read
Requests/sec:   9704.12
Transfer/sec:      1.50MB
interation: 4
wrk -c4 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   420.53us  331.27us  22.78ms   99.09%
    Req/Sec     4.96k   210.10     5.75k    75.40%
  2961689 requests in 5.00m, 458.10MB read
Requests/sec:   9872.23
Transfer/sec:      1.53MB
interation: 5
wrk -c4 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 4 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   420.71us  383.46us  27.57ms   99.07%
    Req/Sec     4.99k   233.19     5.55k    81.85%
  2981580 requests in 5.00m, 461.17MB read
Requests/sec:   9938.42
Transfer/sec:      1.54MB
8 concurrent
interation: 1
wrk -c8 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.85ms    1.19ms 137.60ms   98.10%
    Req/Sec     5.23k   571.24     6.14k    86.87%
  3124380 requests in 5.00m, 483.26MB read
Requests/sec:  10414.47
Transfer/sec:      1.61MB
interation: 2
wrk -c8 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   821.21us  808.88us  40.33ms   98.28%
    Req/Sec     5.30k   452.99     6.06k    87.40%
  3162994 requests in 5.00m, 489.23MB read
Requests/sec:  10543.18
Transfer/sec:      1.63MB
interation: 3
wrk -c8 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   789.55us  685.16us  23.75ms   98.56%
    Req/Sec     5.41k   415.17     6.23k    84.87%
  3227806 requests in 5.00m, 499.26MB read
Requests/sec:  10759.15
Transfer/sec:      1.66MB
interation: 4
wrk -c8 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   799.38us  670.90us  30.35ms   98.66%
    Req/Sec     5.32k   383.13     6.07k    85.27%
  3173289 requests in 5.00m, 490.83MB read
Requests/sec:  10577.46
Transfer/sec:      1.64MB
interation: 5
wrk -c8 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 8 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   826.80us  796.82us  29.97ms   98.28%
    Req/Sec     5.27k   431.13     6.05k    85.87%
  3144436 requests in 5.00m, 486.36MB read
Requests/sec:  10481.23
Transfer/sec:      1.62MB
16 concurrent
interation: 1
wrk -c16 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.44ms    1.50ms 206.24ms   99.10%
    Req/Sec     5.71k   386.85     7.44k    84.56%
  3391377 requests in 5.00m, 524.56MB read
  Socket errors: connect 0, read 16, write 8024, timeout 0
Requests/sec:  11303.00
Transfer/sec:      1.75MB
interation: 2
wrk -c16 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.48ms  380.36us  25.25ms   97.71%
    Req/Sec     5.47k   226.86     5.93k    78.96%
  3266708 requests in 5.00m, 505.28MB read
Requests/sec:  10888.34
Transfer/sec:      1.68MB
interation: 3
wrk -c16 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.46ms  367.23us  29.68ms   97.72%
    Req/Sec     5.53k   197.97     5.98k    76.14%
  3303007 requests in 5.00m, 510.89MB read
Requests/sec:  11009.14
Transfer/sec:      1.70MB
interation: 4
wrk -c16 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.44ms  314.59us  23.08ms   97.15%
    Req/Sec     5.61k   192.81     8.29k    78.55%
  3347230 requests in 5.00m, 517.73MB read
Requests/sec:  11153.80
Transfer/sec:      1.73MB
interation: 5
wrk -c16 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.44ms  337.55us  27.09ms   97.65%
    Req/Sec     5.60k   175.20     5.97k    80.98%
  3343574 requests in 5.00m, 517.17MB read
Requests/sec:  11144.44
Transfer/sec:      1.72MB
32 concurrent
interation: 1
wrk -c32 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.68ms  807.30us 125.33ms   98.41%
    Req/Sec     6.02k   258.79     7.37k    79.88%
  3595256 requests in 5.00m, 556.09MB read
Requests/sec:  11981.55
Transfer/sec:      1.85MB
interation: 2
wrk -c32 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.60ms  490.25us  42.67ms   94.67%
    Req/Sec     6.19k   261.06     7.84k    78.53%
  3696715 requests in 5.00m, 571.79MB read
Requests/sec:  12319.37
Transfer/sec:      1.91MB
interation: 3
wrk -c32 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.63ms  414.28us  42.79ms   91.30%
    Req/Sec     6.10k   217.32     6.65k    78.24%
  3642942 requests in 5.00m, 563.47MB read
Requests/sec:  12141.35
Transfer/sec:      1.88MB
interation: 4
wrk -c32 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.61ms  436.33us  35.46ms   93.02%
    Req/Sec     6.16k   224.22     6.63k    71.21%
  3675269 requests in 5.00m, 568.47MB read
Requests/sec:  12249.01
Transfer/sec:      1.89MB
interation: 5
wrk -c32 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 32 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.68ms  457.85us  33.56ms   92.91%
    Req/Sec     6.00k   314.69     7.30k    76.21%
  3585195 requests in 5.00m, 554.54MB read
Requests/sec:  11948.62
Transfer/sec:      1.85MB
64 concurrent
interation: 1
wrk -c64 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.06ms  642.16us  47.25ms   89.57%
    Req/Sec     6.35k   250.06     7.36k    75.33%
  3791184 requests in 5.00m, 586.40MB read
Requests/sec:  12635.21
Transfer/sec:      1.95MB
interation: 2
wrk -c64 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.33ms  727.66us  47.35ms   92.39%
    Req/Sec     6.03k   313.03     6.79k    75.51%
  3599269 requests in 5.00m, 556.71MB read
Requests/sec:  11994.92
Transfer/sec:      1.86MB
interation: 3
wrk -c64 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.02ms  687.25us  52.08ms   94.16%
    Req/Sec     6.39k   281.57     6.98k    69.87%
  3818035 requests in 5.00m, 590.55MB read
Requests/sec:  12724.53
Transfer/sec:      1.97MB
interation: 4
wrk -c64 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.23ms  737.92us  44.73ms   90.07%
    Req/Sec     6.14k   509.31     7.36k    87.33%
  3666325 requests in 5.00m, 567.09MB read
Requests/sec:  12218.09
Transfer/sec:      1.89MB
interation: 5
wrk -c64 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 64 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     5.35ms  765.71us  57.80ms   91.81%
    Req/Sec     6.01k   339.18     6.88k    74.97%
  3585772 requests in 5.00m, 554.63MB read
Requests/sec:  11950.99
Transfer/sec:      1.85MB
128 concurrent
interation: 1
wrk -c128 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.33ms    1.34ms  54.53ms   89.20%
    Req/Sec     5.67k   367.24     6.53k    75.41%
  3384857 requests in 5.00m, 523.55MB read
Requests/sec:  11280.31
Transfer/sec:      1.74MB
interation: 2
wrk -c128 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.40ms    0.97ms  52.81ms   83.17%
    Req/Sec     6.17k   305.28     7.16k    71.44%
  3686275 requests in 5.00m, 570.17MB read
Requests/sec:  12284.44
Transfer/sec:      1.90MB
interation: 3
wrk -c128 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.92ms    1.09ms  54.11ms   84.94%
    Req/Sec     5.87k   320.78     7.04k    72.39%
  3507285 requests in 5.00m, 542.49MB read
Requests/sec:  11688.34
Transfer/sec:      1.81MB
interation: 4
wrk -c128 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.26ms    1.28ms  55.20ms   87.53%
    Req/Sec     5.70k   349.18     6.53k    72.11%
  3404305 requests in 5.00m, 526.56MB read
Requests/sec:  11344.53
Transfer/sec:      1.75MB
interation: 5
wrk -c128 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 128 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    10.85ms    1.03ms  55.47ms   84.63%
    Req/Sec     5.91k   318.83     6.62k    71.86%
  3531008 requests in 5.00m, 546.16MB read
Requests/sec:  11767.80
Transfer/sec:      1.82MB
256 concurrent
interation: 1
wrk -c256 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.94ms    2.67ms  59.25ms   84.98%
    Req/Sec     5.85k   418.85     6.83k    64.60%
  3491701 requests in 5.00m, 540.08MB read
Requests/sec:  11635.74
Transfer/sec:      1.80MB
interation: 2
wrk -c256 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.97ms    2.41ms  59.15ms   83.90%
    Req/Sec     5.58k   440.85     6.74k    58.67%
  3334604 requests in 5.00m, 515.78MB read
Requests/sec:  11112.82
Transfer/sec:      1.72MB
interation: 3
wrk -c256 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.74ms    2.93ms  71.92ms   83.33%
    Req/Sec     5.64k   439.63     7.76k    54.35%
  3369844 requests in 5.00m, 521.23MB read
Requests/sec:  11229.35
Transfer/sec:      1.74MB
interation: 4
wrk -c256 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.38ms    2.55ms  73.34ms   84.66%
    Req/Sec     5.73k   435.50     6.71k    62.87%
  3423070 requests in 5.00m, 529.46MB read
Requests/sec:  11407.30
Transfer/sec:      1.76MB
interation: 5
wrk -c256 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 256 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.30ms    2.55ms  64.58ms   84.78%
    Req/Sec     5.75k   453.06     6.90k    65.41%
  3435281 requests in 5.00m, 531.35MB read
Requests/sec:  11447.91
Transfer/sec:      1.77MB
512 concurrent
interation: 1
wrk -c512 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.51ms    9.32ms 280.37ms   70.47%
    Req/Sec     5.91k   416.73     7.27k    77.46%
  3527308 requests in 5.00m, 545.58MB read
Requests/sec:  11754.54
Transfer/sec:      1.82MB
interation: 2
wrk -c512 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.86ms    9.68ms 337.06ms   72.45%
    Req/Sec     5.60k   494.65     7.00k    65.76%
  3344695 requests in 5.00m, 517.33MB read
Requests/sec:  11148.06
Transfer/sec:      1.72MB
interation: 3
wrk -c512 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    44.60ms    8.68ms 280.39ms   63.67%
    Req/Sec     5.76k   423.76     7.00k    73.64%
  3436386 requests in 5.00m, 531.52MB read
Requests/sec:  11452.27
Transfer/sec:      1.77MB
interation: 4
wrk -c512 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    46.12ms    9.37ms 278.30ms   66.52%
    Req/Sec     5.57k   511.00     7.18k    66.10%
  3323374 requests in 5.00m, 514.04MB read
Requests/sec:  11075.31
Transfer/sec:      1.71MB
interation: 5
wrk -c512 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.78ms    9.13ms 272.92ms   62.21%
    Req/Sec     5.61k   499.72     7.18k    61.34%
  3348252 requests in 5.00m, 517.88MB read
Requests/sec:  11157.39
Transfer/sec:      1.73MB
512 concurrent
interation: 1
wrk -c512 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    44.81ms    8.83ms 262.72ms   60.20%
    Req/Sec     5.73k   456.40     7.07k    73.24%
  3420068 requests in 5.00m, 528.99MB read
Requests/sec:  11396.70
Transfer/sec:      1.76MB
interation: 2
wrk -c512 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    42.61ms    8.51ms 285.39ms   62.29%
    Req/Sec     6.03k   405.28     8.09k    77.36%
  3597593 requests in 5.00m, 556.45MB read
Requests/sec:  11988.88
Transfer/sec:      1.85MB
interation: 3
wrk -c512 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.84ms    8.91ms 265.54ms   59.90%
    Req/Sec     5.60k   460.74     8.65k    59.03%
  3343235 requests in 5.00m, 517.11MB read
Requests/sec:  11140.66
Transfer/sec:      1.72MB
interation: 4
wrk -c512 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.28ms    8.72ms 301.36ms   63.67%
    Req/Sec     5.93k   425.35     7.17k    76.29%
  3542582 requests in 5.00m, 547.94MB read
Requests/sec:  11805.01
Transfer/sec:      1.83MB
interation: 5
wrk -c512 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 512 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.99ms    8.73ms 281.75ms   63.92%
    Req/Sec     5.83k   495.09     9.65k    72.49%
  3483425 requests in 5.00m, 538.79MB read
Requests/sec:  11607.66
Transfer/sec:      1.80MB
1024 concurrent
interation: 1
wrk -c1024 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    92.84ms    7.06ms 323.63ms   85.08%
    Req/Sec     5.54k   469.84     6.65k    48.97%
  3305173 requests in 5.00m, 511.21MB read
Requests/sec:  11013.82
Transfer/sec:      1.70MB
interation: 2
wrk -c1024 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    86.68ms    8.99ms 325.63ms   86.57%
    Req/Sec     5.93k   330.59     7.13k    83.81%
  3543250 requests in 5.00m, 548.05MB read
Requests/sec:  11807.18
Transfer/sec:      1.83MB
interation: 3
wrk -c1024 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    88.92ms    8.24ms 335.97ms   85.10%
    Req/Sec     5.78k   405.80     6.97k    75.84%
  3452135 requests in 5.00m, 533.95MB read
Requests/sec:  11503.91
Transfer/sec:      1.78MB
interation: 4
wrk -c1024 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    93.20ms    7.84ms 334.17ms   85.96%
    Req/Sec     5.52k   463.64     6.73k    47.83%
  3292569 requests in 5.00m, 509.26MB read
Requests/sec:  10974.50
Transfer/sec:      1.70MB
interation: 5
wrk -c1024 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    92.32ms    7.95ms 347.27ms   79.22%
    Req/Sec     5.57k   475.03     7.02k    52.48%
  3323950 requests in 5.00m, 514.13MB read
Requests/sec:  11077.91
Transfer/sec:      1.71MB
2048 concurrent
interation: 1
wrk -c2048 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 2048 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   178.85ms   10.38ms 421.18ms   83.51%
    Req/Sec     5.75k   437.06     7.14k    72.75%
  3432051 requests in 5.00m, 530.83MB read
Requests/sec:  11438.96
Transfer/sec:      1.77MB
interation: 2
wrk -c2048 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 2048 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   186.47ms   12.14ms 424.17ms   66.14%
    Req/Sec     5.51k   503.70     8.44k    62.53%
  3290707 requests in 5.00m, 508.96MB read
Requests/sec:  10967.27
Transfer/sec:      1.70MB
interation: 3
wrk -c2048 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 2048 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   182.67ms   12.44ms 411.92ms   76.30%
    Req/Sec     5.63k   491.50     7.99k    63.68%
  3359540 requests in 5.00m, 519.63MB read
Requests/sec:  11196.71
Transfer/sec:      1.73MB
interation: 4
wrk -c2048 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 2048 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   188.86ms   12.57ms 420.19ms   84.95%
    Req/Sec     5.44k   532.83     8.91k    67.60%
  3249110 requests in 5.00m, 502.53MB read
Requests/sec:  10828.57
Transfer/sec:      1.67MB
interation: 5
wrk -c2048 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 2048 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   184.85ms   12.52ms 431.46ms   70.00%
    Req/Sec     5.56k   492.05     7.25k    60.95%
  3319875 requests in 5.00m, 513.50MB read
Requests/sec:  11064.31
Transfer/sec:      1.71MB
4096 concurrent
interation: 1
wrk -c4096 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 4096 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   413.12ms   27.69ms 635.70ms   73.88%
    Req/Sec     4.97k   531.73     8.01k    75.04%
  2968959 requests in 5.00m, 459.21MB read
Requests/sec:   9893.60
Transfer/sec:      1.53MB
interation: 2
wrk -c4096 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 4096 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   407.74ms   30.97ms 636.01ms   75.17%
    Req/Sec     5.04k   732.21     8.93k    71.15%
  3008579 requests in 5.00m, 465.33MB read
Requests/sec:  10026.27
Transfer/sec:      1.55MB
interation: 3
wrk -c4096 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 4096 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   381.70ms   22.10ms 574.19ms   72.95%
    Req/Sec     5.39k   606.87     9.35k    74.19%
  3213747 requests in 5.00m, 497.03MB read
Requests/sec:  10710.44
Transfer/sec:      1.66MB
interation: 4
wrk -c4096 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 4096 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   369.94ms   19.41ms 669.79ms   78.06%
    Req/Sec     5.55k   580.34     8.57k    71.04%
  3314237 requests in 5.00m, 512.61MB read
Requests/sec:  11045.01
Transfer/sec:      1.71MB
interation: 5
wrk -c4096 -t 2 -d300s http://10.1.0.9:80/php/date.php
Running 5m test @ http://10.1.0.9:80/php/date.php
  2 threads and 4096 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   363.94ms   15.72ms 605.22ms   83.41%
    Req/Sec     5.65k   498.86     7.66k    67.21%
  3369976 requests in 5.00m, 521.24MB read
Requests/sec:  11229.85
Transfer/sec:      1.74MB